package b_operation;

public class OperationBasic {
	
	public static void main(String[] args) {
		
		/*
		 1. 연산자 기본
		   - 단항연산자 : ++, --, +(양수), -(음수), ~(비트전환연산자), !(부정연산자), (타입)(캐스트연산자)
		   - 이항연산자
		     : 산술연산자 => +, -, *, /, %, <<, >>, >>>
		     : 비교연산자 => <, >, <=, >=, ==, !=, instanceof(7장)
		     : 논리연산자 => &(and), |(or), ^, &&, || 
		   - 삼항연산자
		     : 조건식 ? 조건식이 true : 조건식이 false
		   - 대입연산자
		     : =
		     : op=  =>   +=, -=, *= ......
		 
		 2.  연산 우선순위
		   - 산술연산자 > 비교연산자 > 논리연산자 > 대입연산자
		   - 단항 > 이항 > 삼항
		   - 단항연산자와 대입연산자를 제외한 모든 연산의 진행방향은 왼쪽에서 오른쪽이다.
		 */
	}

}
